# Pandas

the main data structures pandas provides are series and dataframe .after a brief introduction to these two data structures and data igestion, the key feature of pandas this notebook coves are:

In [1]:
import pandas as pd

Introduction to pandas data structures

"pandas" has two main data structures it use namely *series* and *dataframe*

# Pandas Series

In [2]:
ser=pd.Series(data=[100,200,300,400,500], index=['tom','bob','nancy','dan','eric'])

In [3]:
ser

tom      100
bob      200
nancy    300
dan      400
eric     500
dtype: int64

In [4]:
ser.index

Index(['tom', 'bob', 'nancy', 'dan', 'eric'], dtype='object')

In [5]:
ser['nancy']

300

In [6]:
ser[[4,3,1]]

eric    500
dan     400
bob     200
dtype: int64

In [7]:
'bob' in ser  # sonam in ser

True

In [8]:
ser

tom      100
bob      200
nancy    300
dan      400
eric     500
dtype: int64

In [9]:
ser*2  #: multiplication of all values in ser

tom       200
bob       400
nancy     600
dan       800
eric     1000
dtype: int64

In [10]:
ser**2 # ** is for square of all values in ser

tom       10000
bob       40000
nancy     90000
dan      160000
eric     250000
dtype: int64

# pandas Dataframe

pandas Dataframe is a 2-dimensional data frame structure

Create Dataframe from dictionary of python series

In [11]:
d = {'one' : pd.Series([100.,200.,300.] , index=['apple','ball','clock']),
     'two': pd.Series([111.,222.,333.,4444.] , index = ['apple','ball','crill','dancy'])}

In [12]:
df = pd.DataFrame(d)
print(df)

         one     two
apple  100.0   111.0
ball   200.0   222.0
clock  300.0     NaN
crill    NaN   333.0
dancy    NaN  4444.0

In [13]:
df.index

Index(['apple', 'ball', 'clock', 'crill', 'dancy'], dtype='object')

In [14]:
df.columns

Index(['one', 'two'], dtype='object')

In [15]:
pd.DataFrame(d, index=['dancy' ,'ball','apple'])

         one     two
dancy    NaN  4444.0
ball   200.0   222.0
apple  100.0   111.0

In [16]:
pd.DataFrame(d, index=['dancy','ball','apple'] , columns=['two','five'])

          two five
dancy  4444.0  NaN
ball    222.0  NaN
apple   111.0  NaN

Create DataFrame from list of python dictionaries

In [17]:
data=[{'a':1,'b':2}, {'z':100,'apple':200 , 'red':300}]
pd.DataFrame(data)

     a    b      z  apple    red
0  1.0  2.0    NaN    NaN    NaN
1  NaN  NaN  100.0  200.0  300.0

In [18]:
data=[{'alex':1 , 'joe':2 },{'ema':5,'dora':10 , 'alice':20}]

In [19]:
pd.DataFrame(data)

   alex  joe  ema  dora  alice
0   1.0  2.0  NaN   NaN    NaN
1   NaN  NaN  5.0  10.0   20.0

In [20]:
pd.DataFrame(data , index=['orange','red'])

        alex  joe  ema  dora  alice
orange   1.0  2.0  NaN   NaN    NaN
red      NaN  NaN  5.0  10.0   20.0

In [21]:
pd.DataFrame(data , columns=['joe','dora','alice'])

   joe  dora  alice
0  2.0   NaN    NaN
1  NaN  10.0   20.0

Basic DataFrame Operation

In [22]:
df

         one     two
apple  100.0   111.0
ball   200.0   222.0
clock  300.0     NaN
crill    NaN   333.0
dancy    NaN  4444.0

In [23]:
df['one']

apple    100.0
ball     200.0
clock    300.0
crill      NaN
dancy      NaN
Name: one, dtype: float64

In [24]:
df['three'] = df['one'] * df['two']
df

         one     two    three
apple  100.0   111.0  11100.0
ball   200.0   222.0  44400.0
clock  300.0     NaN      NaN
crill    NaN   333.0      NaN
dancy    NaN  4444.0      NaN

In [25]:
df['flag'] = df['one'] >250  # if one>250 : store. flag otherwise pass
df

         one     two    three   flag
apple  100.0   111.0  11100.0  False
ball   200.0   222.0  44400.0  False
clock  300.0     NaN      NaN   True
crill    NaN   333.0      NaN  False
dancy    NaN  4444.0      NaN  False

In [26]:
three= df.pop('three')

In [27]:
three

apple    11100.0
ball     44400.0
clock        NaN
crill        NaN
dancy        NaN
Name: three, dtype: float64

In [28]:
df

         one     two   flag
apple  100.0   111.0  False
ball   200.0   222.0  False
clock  300.0     NaN   True
crill    NaN   333.0  False
dancy    NaN  4444.0  False

In [29]:
del df['two']

In [30]:
df

         one   flag
apple  100.0  False
ball   200.0  False
clock  300.0   True
crill    NaN  False
dancy    NaN  False

In [31]:
df.insert(0, ' copy_of_one' , df['one'])   # 0 is index value
df

        copy_of_one    one   flag
apple         100.0  100.0  False
ball          200.0  200.0  False
clock         300.0  300.0   True
crill           NaN    NaN  False
dancy           NaN    NaN  False

In [32]:
df['one_upper_half'] = df['one'][:2]
df

        copy_of_one    one   flag  one_upper_half
apple         100.0  100.0  False           100.0
ball          200.0  200.0  False           200.0
clock         300.0  300.0   True             NaN
crill           NaN    NaN  False             NaN
dancy           NaN    NaN  False             NaN

Case study: movie Data Analysis

# Use Pandas to Read the Dataset

In [33]:
import pandas as pd

movies=pd.read_csv("C:/Users/LENOVO/Downloads/movies.csv", sep=',')
print(type(movies))
movies.head(10)

<class 'pandas.core.frame.DataFrame'>

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy
5,6,Heat (1995),Action|Crime|Thriller
6,7,Sabrina (1995),Comedy|Romance
7,8,Tom and Huck (1995),Adventure|Children
8,9,Sudden Death (1995),Action
9,10,GoldenEye (1995),Action|Adventure|Thriller

In [34]:
# Timestamps represent second since midnight coordinate universal time (UTC)

tags = pd.read_csv("C:/Users/LENOVO/Downloads/tags.csv" , sep=',')
tags.head()

   userId  movieId               tag   timestamp
0       3      260           classic  1439472355
1       3      260            sci-fi  1439472256
2       4     1732       dark comedy  1573943598
3       4     1732    great dialogue  1573943604
4       4     7569  so bad it's good  1573943455

In [35]:
ratings = pd.read_csv('C:/Users/LENOVO/Downloads/ratings.csv', sep=',' , parse_dates=['timestamp'])
ratings.head()

   userId  movieId  rating   timestamp
0       1      296     5.0  1147880044
1       1      306     3.5  1147868817
2       1      307     5.0  1147868828
3       1      665     5.0  1147878820
4       1      899     3.5  1147868510

In [36]:
# for current, we will remove timestamp (we will come back to it!)
del ratings['timestamp']
del tags['timestamp']

#  Data Structures

# Series

In [37]:
# Extract 0th row: notice that it is infact a series
row_0= tags.iloc[0]
type(row_0)

pandas.core.series.Series

In [38]:
print(row_0)

userId           3
movieId        260
tag        classic
Name: 0, dtype: object

In [39]:
row_0.index

Index(['userId', 'movieId', 'tag'], dtype='object')

In [40]:
row_0['userId']

3

In [41]:
'ratings' in row_0

False

In [42]:
row_0.name

0

In [43]:
row_0=row_0.rename('first_row')
row_0.name

'first_row'

In [44]:
print(row_0)

userId           3
movieId        260
tag        classic
Name: first_row, dtype: object

# DataFrame

In [45]:
tags.head()

   userId  movieId               tag
0       3      260           classic
1       3      260            sci-fi
2       4     1732       dark comedy
3       4     1732    great dialogue
4       4     7569  so bad it's good

In [46]:
tags.columns

Index(['userId', 'movieId', 'tag'], dtype='object')

In [47]:
# Extract row 0 ,11,2000 from DataFrame
tags.iloc[[0,11,2000]]

      userId  movieId           tag
0          3      260       classic
11         4   164909        cliche
2000     647   164179  twist ending

 #  Descriptive Statistics

In [48]:
ratings['rating'].describe()

count    1.048575e+06
mean     3.535808e+00
std      1.056276e+00
min      5.000000e-01
25%      3.000000e+00
50%      3.500000e+00
75%      4.000000e+00
max      5.000000e+00
Name: rating, dtype: float64

In [49]:
ratings['rating'].mean()

3.5358081205445484

In [50]:
ratings.mean()

userId      3575.093078
movieId    21192.019575
rating         3.535808
dtype: float64

In [51]:
ratings['rating'].min()

0.5

In [52]:
ratings['rating'].max()

5.0

In [53]:
ratings['rating'].std()

1.056275694054384

In [54]:
ratings['rating'].mode()

0    4.0
Name: rating, dtype: float64

In [55]:
ratings.corr()  # -1 to +1 (stonest)

           userId   movieId    rating
userId   1.000000  0.007713 -0.009363
movieId  0.007713  1.000000 -0.006169
rating  -0.009363 -0.006169  1.000000

In [56]:
filter_1=ratings['rating']>5
filter_1.any() # is there any value greater than 5.

False

In [57]:
filter_2=ratings['rating']>0
filter_2.all() # all values are greater than 0

True

# Data cleaning : Handling Missing Data

In [58]:
movies.shape

(62423, 3)

In [59]:
# is any row null ? 
movies.isnull() . any()

movieId    False
title      False
genres     False
dtype: bool

In [60]:
ratings.shape

(1048575, 3)

In [61]:
# is any row Null ? 
ratings.isnull().any()

userId     False
movieId    False
rating     False
dtype: bool

In [62]:
tags.shape

(1093360, 3)

In [69]:
# is any row null ?
tags = tags.dropna()  # fillna()

In [70]:
# check again : is any row null ?
tags.isnull().any()

userId     False
movieId    False
tag        False
dtype: bool

In [71]:
tags.shape

(1093344, 3)

#  Slicing out Columns

In [72]:
tags['tag'].head()

0             classic
1              sci-fi
2         dark comedy
3      great dialogue
4    so bad it's good
Name: tag, dtype: object

In [74]:
movies[['title','genres']].head()

,title,genres
0,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,Jumanji (1995),Adventure|Children|Fantasy
2,Grumpier Old Men (1995),Comedy|Romance
3,Waiting to Exhale (1995),Comedy|Drama|Romance
4,Father of the Bride Part II (1995),Comedy

In [75]:
ratings[1000:1010]

      userId  movieId  rating
1000       4    45517     2.5
1001       4    45722     3.5
1002       4    46948     2.5
1003       4    46972     3.5
1004       4    48780     5.0
1005       4    48982     3.0
1006       4    49272     3.5
1007       4    49396     3.5
1008       4    49649     1.0
1009       4    50601     1.5

In [78]:
tag_counts=tags['tag'].value_counts()
tag_counts[:10]

sci-fi                8330
atmospheric           6516
action                5907
comedy                5702
surreal               5326
based on a book       5079
twist ending          4820
funny                 4738
visually appealing    4526
dystopia              4257
Name: tag, dtype: int64

# Filter for Selecting Rows

In [79]:
is_highly_rated = ratings['rating']>=4
# selecting data which has rating greater than equal to 4.
ratings[is_highly_rated][-5:]

         userId  movieId  rating
1048567    7045     4308     4.0
1048571    7045     4720     4.0
1048572    7045     4857     4.0
1048573    7045     4886     5.0
1048574    7045     4896     4.0

In [81]:
is_animation = movies['genres'].str.contains('Animation')
# select data which has animation as a category form genres coulmn
movies[is_animation][5:15]

,movieId,title,genres
309,313,"Swan Princess, The (1994)",Animation|Children
359,364,"Lion King, The (1994)",Adventure|Animation|Children|Drama|Musical|IMAX
387,392,"Secret Adventures of Tom Thumb, The (1993)",Adventure|Animation
545,551,"Nightmare Before Christmas, The (1993)",Animation|Children|Fantasy|Musical
551,558,"Pagemaster, The (1994)",Action|Adventure|Animation|Children|Fantasy
580,588,Aladdin (1992),Adventure|Animation|Children|Comedy|Musical
586,594,Snow White and the Seven Dwarfs (1937),Animation|Children|Drama|Fantasy|Musical
587,595,Beauty and the Beast (1991),Animation|Children|Fantasy|Musical|Romance|IMAX
588,596,Pinocchio (1940),Animation|Children|Fantasy|Musical
602,610,Heavy Metal (1981),Action|Adventure|Animation|Horror|Sci-Fi

In [82]:
movies[is_animation].head(15)

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
12,13,Balto (1995),Adventure|Animation|Children
47,48,Pocahontas (1995),Animation|Children|Drama|Musical|Romance
236,239,"Goofy Movie, A (1995)",Animation|Children|Comedy|Romance
241,244,Gumby: The Movie (1995),Animation|Children
309,313,"Swan Princess, The (1994)",Animation|Children
359,364,"Lion King, The (1994)",Adventure|Animation|Children|Drama|Musical|IMAX
387,392,"Secret Adventures of Tom Thumb, The (1993)",Adventure|Animation
545,551,"Nightmare Before Christmas, The (1993)",Animation|Children|Fantasy|Musical
551,558,"Pagemaster, The (1994)",Action|Adventure|Animation|Children|Fantasy
580,588,Aladdin (1992),Adventure|Animation|Children|Comedy|Musical
586,594,Snow White and the Seven Dwarfs (1937),Animation|Children|Drama|Fantasy|Musical
587,595,Beauty and the Beast (1991),Animation|Children|Fantasy|Musical|Romance|IMAX
588,596,Pinocchio (1940),Animation|Children|Fantasy|Musical
602,610,Heavy Metal (1981),Action|Adventure|Animation|Horror|Sci-Fi

# Group by and Aggregate

In [84]:
ratings_count = ratings[['movieId','rating']] . groupby('rating').count()
ratings_count

        movieId
rating
0.5       15139
1.0       31975
1.5       17494
2.0       69617
2.5       53093
3.0      207514
3.5      130755
4.0      280291
4.5       90051
5.0      152646

In [85]:
average_rating = ratings[['movieId','rating']]. groupby('movieId') .mean()
average_rating.tail()

         rating
movieId
208112      5.0
208737      3.5
208793      3.5
208939      4.0
209163      4.5

In [86]:
movie_count = ratings[['movieId','rating']] . groupby('movieId').count()
movie_count.head()

         rating
movieId
1          2465
2          1012
3           525
4            97
5           517

In [89]:
movie_count = ratings[['movieId','rating']].groupby('movieId').count()
movie_count.tail()

         rating
movieId
208112        1
208737        1
208793        1
208939        1
209163        1

# Merge DataFrames

In [90]:
tags.head()

   userId  movieId               tag
0       3      260           classic
1       3      260            sci-fi
2       4     1732       dark comedy
3       4     1732    great dialogue
4       4     7569  so bad it's good

In [91]:
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [92]:
t= movies.merge(tags,on='movieId' ,how='inner') # type of join 
t.shape # merge on movieId because common column between both df.

(1093344, 5)

In [93]:
t

,movieId,title,genres,userId,tag
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,791,Owned
1,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1048,imdb top 250
2,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1361,Pixar
3,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,3164,Pixar
4,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,3164,time travel
...,...,...,...,...,...
1093339,209063,The Prep School Negro (2012),(no genres listed),96399,Philadelphia
1093340,209063,The Prep School Negro (2012),(no genres listed),96399,private school
1093341,209063,The Prep School Negro (2012),(no genres listed),96399,quaker
1093342,209063,The Prep School Negro (2012),(no genres listed),96399,racism
1093343,209063,The Prep School Negro (2012),(no genres listed),96399,thought-provoking

In [95]:
f=movies.merge(tags, on='movieId', how='outer')
f.shape

(1110516, 5)

In [96]:
print("\U0001F923")

# Combine aggregation, merging,and filters to get useful analytics

In [98]:
avg_ratings = ratings.groupby('movieId' , as_index=False).mean()
# as_index  = false won't make movieId as index 
del avg_ratings['userId']
avg_ratings.head()

   movieId    rating
0        1  3.896957
1        2  3.305830
2        3  3.169524
3        4  2.943299
4        5  3.133462

In [99]:
box_office = movies.merge(avg_ratings , on='movieId',how ='inner')
box_office.tail()

,movieId,title,genres,rating
22235,208112,Rudolph the Red-Nosed Reindeer & the Island of...,Animation|Children,5.0
22236,208737,Midway (2019),Action|Drama|War,3.5
22237,208793,Watchman (2019),Drama|Thriller,3.5
22238,208939,Klaus (2019),Adventure|Animation|Children|Comedy,4.0
22239,209163,Bad Poems (2018),Comedy|Drama,4.5

In [100]:
is_highly_rated = box_office['rating']>=4.0

box_office[is_highly_rated][-5:]

,movieId,title,genres,rating
22228,207367,Little Monsters (2019),Comedy|Horror,4.5
22230,207642,Kabir Singh (2019),Action|Drama|Romance,5.0
22235,208112,Rudolph the Red-Nosed Reindeer & the Island of...,Animation|Children,5.0
22238,208939,Klaus (2019),Adventure|Animation|Children|Comedy,4.0
22239,209163,Bad Poems (2018),Comedy|Drama,4.5

In [102]:
is_comedy = box_office['genres'].str.contains('Comedy')
box_office[is_comedy][:5]

,movieId,title,genres,rating
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,3.896957
2,3,Grumpier Old Men (1995),Comedy|Romance,3.169524
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance,2.943299
4,5,Father of the Bride Part II (1995),Comedy,3.133462
6,7,Sabrina (1995),Comedy|Romance,3.404982

In [103]:
box_office[is_comedy & is_highly_rated][-5:]

,movieId,title,genres,rating
22220,206899,Charlie's Angels (2019),Action|Adventure|Comedy,4.0
22227,207311,Last Christmas (2019),Comedy|Romance,4.0
22228,207367,Little Monsters (2019),Comedy|Horror,4.5
22238,208939,Klaus (2019),Adventure|Animation|Children|Comedy,4.0
22239,209163,Bad Poems (2018),Comedy|Drama,4.5

# Vectorized String Operations

In [104]:
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

Split 'genres'into multiple columns

In [111]:
movie_genres = movies['genres'].str. split('|' , expand =True)

In [112]:
movie_genres[:10]

,0,1,2,3,4,5,6,7,8,9
0,Adventure,Animation,Children,Comedy,Fantasy,None,None,None,None,None
1,Adventure,Children,Fantasy,None,None,None,None,None,None,None
2,Comedy,Romance,None,None,None,None,None,None,None,None
3,Comedy,Drama,Romance,None,None,None,None,None,None,None
4,Comedy,None,None,None,None,None,None,None,None,None
5,Action,Crime,Thriller,None,None,None,None,None,None,None
6,Comedy,Romance,None,None,None,None,None,None,None,None
7,Adventure,Children,None,None,None,None,None,None,None,None
8,Action,None,None,None,None,None,None,None,None,None
9,Action,Adventure,Thriller,None,None,None,None,None,None,None

# Add a new column for comedy genre flag

In [113]:
movie_genres['iscomdey'] = movies['genres'].str.contains ('comdey')

In [115]:
movie_genres[:10]

,0,1,2,3,4,5,6,7,8,9,iscomdey
0,Adventure,Animation,Children,Comedy,Fantasy,None,None,None,None,None,False
1,Adventure,Children,Fantasy,None,None,None,None,None,None,None,False
2,Comedy,Romance,None,None,None,None,None,None,None,None,False
3,Comedy,Drama,Romance,None,None,None,None,None,None,None,False
4,Comedy,None,None,None,None,None,None,None,None,None,False
5,Action,Crime,Thriller,None,None,None,None,None,None,None,False
6,Comedy,Romance,None,None,None,None,None,None,None,None,False
7,Adventure,Children,None,None,None,None,None,None,None,None,False
8,Action,None,None,None,None,None,None,None,None,None,False
9,Action,Adventure,Thriller,None,None,None,None,None,None,None,False

Etraxct year from title e.g(1995)

In [116]:
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [117]:
movies['year'] = movies['title'].str.extract('.*\((.*)\).*', expand =True)

In [118]:
movies.tail()

       movieId                           title                  genres  year
62418   209157                       We (2018)                   Drama  2018
62419   209159       Window of the Soul (2001)             Documentary  2001
62420   209163                Bad Poems (2018)            Comedy|Drama  2018
62421   209169             A Girl Thing (2001)      (no genres listed)  2001
62422   209171  Women of Devil's Island (1962)  Action|Adventure|Drama  1962

# Parsing Timestamps

Timestamps are common in sensor data or other time series datasets.Let us revisit the tags.csv dataset and read the timestamps

In [119]:
tags = pd.read_csv('C:/Users/LENOVO/Downloads/tags.csv', sep = ',')

In [120]:
tags.dtypes

userId        int64
movieId       int64
tag          object
timestamp     int64
dtype: object

Unix time / POSIX time / epoch time record time in second 
since midnight Coordinated Universal Time (UTC) of january 1 , 1970

In [121]:
tags.head()

   userId  movieId               tag   timestamp
0       3      260           classic  1439472355
1       3      260            sci-fi  1439472256
2       4     1732       dark comedy  1573943598
3       4     1732    great dialogue  1573943604
4       4     7569  so bad it's good  1573943455

In [123]:
tags['parsed_time'] = pd.to_datetime(tags['timestamp'] , unit = 's')

Data Type datetime64[ns] maps to either m8[ns] depending on the HARDWARE

In [124]:
tags['parsed_time'] . dtype

dtype('<M8[ns]')

In [125]:
tags.head(2)

   userId  movieId      tag   timestamp         parsed_time
0       3      260  classic  1439472355 2015-08-13 13:25:55
1       3      260   sci-fi  1439472256 2015-08-13 13:24:16

Selecting rows based on timestamp

In [127]:
greater_than_t= tags['parsed_time'] > ' 2015-02-01'

selected_rows = tags[greater_than_t]
tags.shape,selected_rows.shape

((1093360, 5), (692112, 5))

Sorting the table using the timestamps

In [129]:
tags.sort_values(by = 'parsed_time',ascending = True)[:10]

        userId  movieId              tag   timestamp         parsed_time
900600  129396     2788     monty python  1135429210 2005-12-24 13:00:10
900595  129396     1732    coen brothers  1135429236 2005-12-24 13:00:36
900592  129396     1206  stanley kubrick  1135429248 2005-12-24 13:00:48
900591  129396     1193   jack nicholson  1135429371 2005-12-24 13:02:51
900607  129396     5004    peter sellers  1135429399 2005-12-24 13:03:19
900589  129396       47        brad pitt  1135429412 2005-12-24 13:03:32
900590  129396       47   morgan freeman  1135429412 2005-12-24 13:03:32
900605  129396     4011      guy ritchie  1135429431 2005-12-24 13:03:51
900604  129396     4011        brad pitt  1135429431 2005-12-24 13:03:51
900588  129396       32     bruce willis  1135429442 2005-12-24 13:04:02

# Average Movie Rating over time 
 Are movie ratings related to the year of launch ?

In [131]:
average_rating = ratings[['movieId','rating']] . groupby('movieId' , as_index =False).mean()
average_rating.tail()

       movieId  rating
22235   208112     5.0
22236   208737     3.5
22237   208793     3.5
22238   208939     4.0
22239   209163     4.5

In [132]:
joined = movies.merge(average_rating , on = 'movieId' , how= 'inner')
# joined.head()
joined.corr()

          movieId    rating
movieId  1.000000 -0.018544
rating  -0.018544  1.000000

In [133]:
yearly_average = joined[['year','rating']]. groupby('year',as_index=False).mean()
yearly_average[:10]

   year    rating
0  1895  4.000000
1  1896  4.500000
2  1898  4.000000
3  1900  4.000000
4  1902  3.714286
5  1903  3.464286
6  1908  3.750000
7  1911  3.250000
8  1913  3.812500
9  1914  2.750000

Do some year look better for the box office movies than other ?


Does any data point seem like an outlier in some sense?